/*
Введение в ООП

Обьектно-ориентированное программирование (ООП) - подход, при котором программа состоит из объектов. 

Объект - некая сущность, которая существует в пространстве и времени.
У каждого объекта есть свойства (тип и характеристики)

Объекты принято классифицировать. Множество объектов с одинаковым набором атрибутов - называется классом.
Класс - синтаксическая конструкция, которая позволяет описывать обьекты.
Класс состоит из полей (членов). Поля класса делятся на два типа : переменные и методы.

Переменные члены класса описывают характеристики (свойства) объекта или характеризуют объект (показывают какой он), а так же отображают его состояние
Методы определяют поведение объекта и взаимодействие его с другими объектами как этого, так и других классов.

Метод - функция внутри класса!!!!

Кроме классов , обьекты можно описывать при помощи структур
Структура - синтаксическая контрукция для описания объектов, с одним небольшим отличием.
*/